---
kind: method
id: M:Autodesk.Revit.DB.ParameterUtils.GetAllBuiltInGroups
source: html/884d14d3-02e5-5631-adb3-79c612d04b5a.htm
---
# Autodesk.Revit.DB.ParameterUtils.GetAllBuiltInGroups Method

Gets the identifiers of all built-in parameter groups.

## Syntax (C#)
```csharp
public static IList<ForgeTypeId> GetAllBuiltInGroups()
```

## Returns
The built-in group identifiers.